{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_14", "dim_ordering": "th", "border_mode": "valid", "strides": [2, 2], "input_dtype": "float32", "batch_input_shape": [null, 512, 14, 14]}}, {"class_name": "Flatten", "config": {"name": "flatten_6", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "p": 0.8, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "bias": true, "output_dim": 256, "name": "dense_14", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "trainable": true, "input_dim": 25088, "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "trainable": true, "mode": 0, "name": "batchnormalization_17", "axis": -1, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_9", "p": 0.8, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "bias": true, "output_dim": 256, "name": "dense_15", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "trainable": true, "input_dim": 256, "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "trainable": true, "mode": 0, "name": "batchnormalization_18", "axis": -1, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_10", "p": 0.8, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "bias": true, "output_dim": 13, "name": "dense_16", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "trainable": true, "input_dim": 256, "activation": "softmax"}}]}